# SharedPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalOrigin..::..SharedPosition Property
InternalOrigin Class See Also
---
The position of the InternalOrigin relative to the active ProjectLocation set for the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.2
# Syntax
C#
---
```text
public XYZ SharedPosition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SharedPosition As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ SharedPosition {
	XYZ^ get ();
}
```

# See Also
InternalOrigin Class
Autodesk.Revit.DB Namespace